DataProcessors/ТК_ПечатьЭтикетокИЦенников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТК_ПечатьЭтикетокИЦенников</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Comment>Код производителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество ценников</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОПТ</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ТК_ПечатьЭтикетокИЦенников/Ext/ManagerModule.bsl
Функция СформироватьЦенник60х38QR(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенника");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	НаЛисте = 0;
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	
	Если ТипЗнч(тчТовары) = Тип("ДанныеФормыКоллекция") Тогда
		тчТоварыСклады = тчТовары.выгрузить(,"Выбран,СкладКомпании");
	Иначе
		тчТоварыСклады = тчТовары.Скопировать(,"Выбран,СкладКомпании");
	КонецЕсли;
	тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	Для Каждого строкаСклад Из тчТоварыСклады Цикл
		Если Не строкаСклад.Выбран Тогда 
			Продолжить;
		КонецЕсли;
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		НаЛисте = 0;
		
		ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование)+"'   маршрут № "+строкаСклад.СкладКомпании.Маршрут;
		ТабДок.Вывести(ОбластьСклад);
		
		НаЛисте = НаЛисте +1;
		вСтроке = 0;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
		ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из ТоварСклада Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
			
			ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
			Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
				ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
			
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			
			Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
				СтрокаQR = СокрЛП(СтрТовары.Артикул);
			Иначе
				СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
			КонецЕсли;
			
			СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
			
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
			ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
			
			Для Ит = 1 По СтрТовары.Количество Цикл 
				Если вСтроке = 3 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
					НаЛисте = НаЛисте + 1;
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				Если НаЛисте = 7 Тогда 
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					НаЛисте = 0;
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник60х38QRАкция(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенникаАкция");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	вСтроке = 0;
	НаЛисте = 0;
	Дата = ТекущаяДатаСеанса();
	
	тчТоварыСклады = тчТовары.Выгрузить(,"Выбран,СкладКомпании");
	тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	Для Каждого строкаСклад Из тчТоварыСклады Цикл
		Если Не строкаСклад.Выбран Тогда 
			Продолжить;
		КонецЕсли;
		
		// Для вывода названия склада с новой страницы
		Если НаЛисте > 5 Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			НаЛисте = 0;
		КонецЕсли;
		
		ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование)+"'   маршрут № "+строкаСклад.СкладКомпании.Маршрут;
		ТабДок.Вывести(ОбластьСклад);
		
		НаЛисте = НаЛисте +1;
		вСтроке = 0;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
		ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из ТоварСклада Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
			СтруктураЦенника.Вставить("ЦенаСтарая", Формат(СтрТовары.СтараяЦена, "ЧДЦ=2; ЧН="));
			СтруктураЦенника.Вставить("КонецДействия", Формат(СтрТовары.КонецДействия,  "ДФ=dd.MM.yy"));
			
			Попытка
				СкидкаПроцент = 100-(СтрТовары.Цена/СтрТовары.СтараяЦена*100);
				ПроцентСкидки = "-"+Формат(Цел(СкидкаПроцент),"ЧЦ=3")+"%";
				
				СтруктураЦенника.Вставить("Процент", Формат(ПроцентСкидки, "ЧДЦ=2; ЧН="));
			Исключение
			КонецПопытки;
			
			ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
			Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
				ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
			
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			
			Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
				СтрокаQR = СокрЛП(СтрТовары.Артикул);
			Иначе
				СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
			КонецЕсли;
			
			СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
			
			Для Ит = 1 По СтрТовары.Количество Цикл 
				Если вСтроке = 3 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
					НаЛисте = НаЛисте + 1;
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник120х76QRАкция(тчТовары, ШаблонДляПечати) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	
	БезПроцента = Ложь;
	
	Если ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76ТТ" Тогда 
		//НовыйЦвет = WebЦвета.Желтый;
		НазваниеАкции = "ТОВАР ТИЖНЯ";
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой";
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76РМ" Тогда 
		//НовыйЦвет = WebЦвета.Оранжевый;
		НазваниеАкции = "РОЗПРОДАЖ МРЦ";
		БезПроцента = Истина;
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой1";
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76Р" Тогда 
		//НовыйЦвет = WebЦвета.Оранжевый;
		НазваниеАкции = "РОЗПРОДАЖ";
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой";
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76ПЦ" Тогда 
		//НовыйЦвет = WebЦвета.СинеСерый;
		НазваниеАкции = "ПЕРША ЦІНА";
		БезПроцента = Истина;
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой1";
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76А" Тогда 
		//НовыйЦвет = WebЦвета.Желтый;
		НазваниеАкции = "АКЦІЯ";
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой";
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76КБПМ" Тогда 
		//НовыйЦвет = WebЦвета.Желтый;
		НазваниеАкции = "КУПУЙ БІЛЬШЕ - ПЛАТИ МЕНШЕ!";
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой2";
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76ШЦ" Тогда 
		//НовыйЦвет = WebЦвета.Желтый;
		НазваниеАкции = "ШОК ЦІНА!";
		НМакет = "ПФ_MXL_МакетЦенникаАкцияБольшой";
	КонецЕсли;

	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет(НМакет);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	вСтроке = 0;
	НаЛисте = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
		СтруктураЦенника.Вставить("ЦенаСтарая", Формат(СтрТовары.СтараяЦена, "ЧДЦ=2; ЧН="));
		СтруктураЦенника.Вставить("КонецДействия", Формат(СтрТовары.КонецДействия,  "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("НазваниеАкции", НазваниеАкции);

		Попытка
			Если НЕ БезПроцента Тогда 
				СкидкаПроцент = 100-(СтрТовары.Цена/СтрТовары.СтараяЦена*100);
				ПроцентСкидки = "-"+Формат(Цел(СкидкаПроцент),"ЧЦ=3")+"%";
				
				СтруктураЦенника.Вставить("Процент", Формат(ПроцентСкидки, "ЧДЦ=2; ЧН="));
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		Если СтрДлина(ПредставлениеТовара) > 50 Тогда
			ОбластьЦенник.Область("R3C1:R10C5").Шрифт = Новый Шрифт(,12,Истина);
		Иначе
			ОбластьЦенник.Область("R3C1:R10C5").Шрифт = Новый Шрифт(,14,Истина);
		КонецЕсли;
	
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
		
		
		Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
			СтрокаQR = СокрЛП(СтрТовары.Артикул);
		Иначе
			СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
		КонецЕсли;
		
		СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
		ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода, Истина);				
		
		//ОбластьЦенник.Рисунки.QrКод.ЦветФона = НовыйЦвет;

		Для Ит = 1 По СтрТовары.Количество Цикл 
			
			Если вСтроке = 2 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
				НаЛисте = НаЛисте + 1;
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
			
			
			Если НаЛисте = 4 Тогда 
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				НаЛисте = 0;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	
КонецФункции

Функция СформироватьЦенник60х38АкцияАттика(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	
	НМакет = "ПФ_MXL_МакетЦенникаАкцияАттика60х38";
	
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет(НМакет);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	вСтроке = 0;
	НаЛисте = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		Если ЗначениеЗаполнено(СтрТовары.НачалоДействия) Тогда
			Дата = СтрТовары.НачалоДействия;
		КонецЕсли;
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		ЦенаАкция = Формат(СтрТовары.СтараяЦена, "ЧДЦ=2; ЧН=");
		Если СтрДлина(ЦенаАкция) > 4 Тогда
			ОбластьЦенник.Рисунки.D2.Шрифт = Новый Шрифт(,12,Истина);
		Иначе
			ОбластьЦенник.Рисунки.D2.Шрифт = Новый Шрифт(,14,Истина);
		КонецЕсли;
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
		СтруктураЦенника.Вставить("ЦенаСтарая", Формат(СтрТовары.СтараяЦена, "ЧДЦ=2; ЧН="));
		СтруктураЦенника.Вставить("КонецДействия", Формат(СтрТовары.КонецДействия,  "ДФ=dd.MM.yy"));
		
		Попытка
			СкидкаПроцент = 100-(СтрТовары.Цена/СтрТовары.СтараяЦена*100);
			ПроцентСкидки = "-"+Формат(Цел(СкидкаПроцент),"ЧЦ=3")+"%";
			
			СтруктураЦенника.Вставить("Процент", Формат(ПроцентСкидки, "ЧДЦ=2; ЧН="));
		Исключение
		КонецПопытки;

		ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		Если СтрДлина(СтрТовары.Наименование2) > 37 Тогда
			ОбластьЦенник.Область("R2C1:R9C5").Шрифт = Новый Шрифт(,9,Истина);
		Иначе
			ОбластьЦенник.Область("R2C1:R9C5").Шрифт = Новый Шрифт(,11,Истина);
		КонецЕсли;
	
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
		
		Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
			СтрокаQR = СокрЛП(СтрТовары.Артикул);
		Иначе
			СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
		КонецЕсли;
		
		СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
		ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
		
		Для Ит = 1 По СтрТовары.Количество Цикл 
			
			Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 3 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
				НаЛисте = НаЛисте + 1;
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			Если НаЛисте = 6 Тогда 
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				НаЛисте = 0;
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;

			
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	
КонецФункции

Функция СформироватьЦенник60х38QRАкцияА4(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенникаАкцияA4");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
		СтруктураЦенника.Вставить("ЦенаСтарая", Формат(СтрТовары.СтараяЦена, "ЧДЦ=2; ЧН="));
		СтруктураЦенника.Вставить("КонецДействия", Формат(СтрТовары.КонецДействия,  "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("НазваниеАкции", "Акция");
		
		Попытка
			СкидкаПроцент = 100-(СтрТовары.Цена/СтрТовары.СтараяЦена*100);
			ПроцентСкидки = "-"+Формат(Цел(СкидкаПроцент),"ЧЦ=3")+"%";
			
			СтруктураЦенника.Вставить("Процент", Формат(ПроцентСкидки, "ЧДЦ=2; ЧН="));
		Исключение
		КонецПопытки;
		
		ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
		
		Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
			СтрокаQR = СокрЛП(СтрТовары.Артикул);
		Иначе
			СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
		КонецЕсли;
				
		СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
		ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
		
		Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 3 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник60х38за50гр(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенникаЗа50г");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ОбластьЦенник.Область("R1C1:R1C5").Шрифт = Новый Шрифт(,10,Истина);
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("ШтрихКод", "50 гр");
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена/20, "ЧДЦ=2; ЧН="));
		
		ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
		
		Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
			СтрокаQR = СокрЛП(СтрТовары.Артикул);
		Иначе
			СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
		КонецЕсли;
		
		Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 3 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник60х38QRза100гр(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенника");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ОбластьЦенник.Область("R1C1:R1C5").Шрифт = Новый Шрифт(,10,Истина);
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("ШтрихКод", "100 гр");
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена/10, "ЧДЦ=2; ЧН="));
		
		ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
		
		Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
			СтрокаQR = СокрЛП(СтрТовары.Артикул);
		Иначе
			СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
		КонецЕсли;
				
		СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена/10, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0")+ "|1";
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
		ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
		
		Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 3 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник60х38Склад(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = ПолучитьМакет("ПФ_MXL_МакетЦенникаСклад");

	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад|Ценник");

	вСтроке = 0;
	НаЛисте = 0;
	Дата = ТекущаяДатаСеанса();
	тчТоварыСклады = тчТовары.Выгрузить(,"Выбран,СкладКомпании");
	тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	Для Каждого строкаСклад Из тчТоварыСклады Цикл
		Если Не строкаСклад.Выбран Тогда 
				Продолжить;
		КонецЕсли;
		
		// Для вывода названия склада с новой страницы
		Если НаЛисте > 5 Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			НаЛисте = 0;
		КонецЕсли;
		
		ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование)+"'   маршрут № "+строкаСклад.СкладКомпании.Маршрут;
		ТабДок.Вывести(ОбластьСклад);
		
		НаЛисте = НаЛисте +1;
		вСтроке = 0;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
		ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из ТоварСклада Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			
			СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
			
			ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
			Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
				ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
			
			Если СтрДлина(СтрТовары.Наименование2) > 37 Тогда
				ОбластьЦенник.Область("R2C1:R10C5").Шрифт = Новый Шрифт(,9,Истина);
			Иначе
				ОбластьЦенник.Область("R2C1:R10C5").Шрифт = Новый Шрифт(,11,Истина);
			КонецЕсли;
			
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			           
			ПараметрыШтрихКода = Новый Структура;
			ПараметрыШтрихКода.Вставить("ШтрихКод", СтрТовары.ШтрихКод);
			ПараметрыШтрихКода.Вставить("Ширина", 75);     
			ПараметрыШтрихКода.Вставить("Высота", 25);
			ПараметрыШтрихКода.Вставить("ТипКода", Истина);
			ПараметрыШтрихКода.Вставить("ОтображатьТекст", Истина);
			
			КартинкаШтрихкода = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихКода);
			
			ОбластьЦенник.Рисунки.Картинка.Картинка  =  КартинкаШтрихкода;				
			
			Для Ит = 1 По СтрТовары.Количество Цикл 
				Если вСтроке = 3 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
					НаЛисте = НаЛисте + 1;
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
			КонецЦикла;
					
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенникАттика(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = ПолучитьМакет("ПФ_MXL_МакетЦенникаАттика");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");

	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Товар = тчТовары.Выгрузить(,"Выбран");
	//тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	//Для Каждого строкаСклад Из тчТоварыСклады Цикл
	//	Если Не строкаСклад.Выбран Тогда 
	//			Продолжить;
	//	КонецЕсли;
	//	ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование);
	//	ТабДок.Вывести(ОбластьСклад);
	//	вСтроке = 0;
	//	
	//	СтруктураОтбора = Новый Структура;
	//	СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
	//	ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из тчТовары Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			
			СтруктураЦенника = Новый Структура("ГруппаЦенообразования, Код");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			СтруктураЦенника.Вставить("ГруппаЦенообразования", СокрЛП(СтрТовары.Номенклатура.ГруппаЦенообразования));
			СтруктураЦенника.Вставить("Код", Формат(СокрЛП(СтрТовары.Номенклатура.Артикул), "ЧДЦ=2; ЧН="));
			СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
			
			ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеRB), СокрЛП(СтрТовары.Номенклатура.НаименованиеRB), СокрЛП(СтрТовары.Номенклатура));
			Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
				ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("Наименование", ПредставлениеТовара);
			
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);

			Для Ит = 1 По СтрТовары.Количество Цикл 
				Если вСтроке = 6 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
			КонецЦикла;
					
		КонецЦикла;
	//КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенникДемента(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = ПолучитьМакет("ПФ_MXL_МакетЦенникДеметра");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");

	вСтроке = 0;
	НаЛисте = 0;
	Дата = ТекущаяДатаСеанса();
	тчТоварыСклады = тчТовары.Выгрузить(,"Выбран,СкладКомпании");
	тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	Для Каждого строкаСклад Из тчТоварыСклады Цикл
		Если Не строкаСклад.Выбран Тогда 
				Продолжить;
		КонецЕсли;
		
		// Для вывода названия склада с новой страницы
		Если НаЛисте > 5 Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			НаЛисте = 0;
		КонецЕсли;
		
		ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование)+"'   маршрут № "+строкаСклад.СкладКомпании.Маршрут;
		ТабДок.Вывести(ОбластьСклад);
		
		НаЛисте = НаЛисте +1;
		вСтроке = 0;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
		ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из ТоварСклада Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			
			СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			СтруктураЦенника.Вставить("Код", Формат(СокрЛП(СтрТовары.Номенклатура.Артикул), "ЧДЦ=2; ЧН="));
			СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
//			СтруктураЦенника.Вставить("ЦенаОпт", Формат(СтрТовары.ЦенаОПТ, "ЧДЦ=2; ЧН="));
			
			ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеRB), СокрЛП(СтрТовары.Номенклатура.НаименованиеRB), СокрЛП(СтрТовары.Номенклатура));
			Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
				ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			ЦенаОпт = Формат(СтрТовары.ЦенаОПТ, "ЧДЦ=2; ЧН=");
			
			Если СтрДлина(ЦенаОпт) > 5 Тогда
				ОбластьЦенник.Область("R6C6:R8C12").Шрифт = Новый Шрифт(,20,Истина);
			Иначе
				ОбластьЦенник.Область("R6C6:R8C12").Шрифт = Новый Шрифт(,24,Истина);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("ЦенаОпт", ЦенаОпт);
			
			СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);

			Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
				СтрокаQR = СокрЛП(СтрТовары.Артикул);
			Иначе
				СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
			КонецЕсли;
			
			СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена/10, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0")+ "|1";
			
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
			ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				

			Для Ит = 1 По СтрТовары.Количество Цикл 
				
				Если вСтроке = 3 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
					НаЛисте = НаЛисте + 1;
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				Если НаЛисте = 7 Тогда 
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					НаЛисте = 0;
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
			КонецЦикла;
					
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник35х30(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенника35х30");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	НаЛисте =0;
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
		
		Номенклатура = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		ПредставлениеТовара = Лев(Номенклатура, 50) + ", " + СокрЛП(СтрТовары.Номенклатура.БазоваяЕдиницаИзмерения);
		
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			
		Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 5 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
				НаЛисте = НаЛисте+1;
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			Если НаЛисте = 9 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				НаЛисте = 0;
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник40х30(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенника40х30");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	НаЛисте =0;
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	
	тчТоварыСклады = тчТовары.Выгрузить(,"Выбран,СкладКомпании");
	тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	Для Каждого строкаСклад Из тчТоварыСклады Цикл
		Если Не строкаСклад.Выбран Тогда 
			Продолжить;
		КонецЕсли;
		
		// Для вывода названия склада с новой страницы
		Если НаЛисте > 5 Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			НаЛисте = 0;
		КонецЕсли;
		
		ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование)+"'   маршрут № "+строкаСклад.СкладКомпании.Маршрут;
		ТабДок.Вывести(ОбластьСклад);
		
		НаЛисте = НаЛисте +1;
		вСтроке = 0;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
		ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из ТоварСклада Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			
			Цена = Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН=");
			
			Если СтрДлина(Цена) > 5 Тогда
				ОбластьЦенник.Область("R6C1:R7C3").Шрифт = Новый Шрифт(,28,Истина);
			Иначе
				ОбластьЦенник.Область("R6C1:R7C3").Шрифт = Новый Шрифт(,35,Истина);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("Цена", Цена);
			
			Номенклатура = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
			//ПредставлениеТовара = Лев(Номенклатура, 50) + ", " + СокрЛП(СтрТовары.Номенклатура.БазоваяЕдиницаИзмерения);
			ПредставлениеТовара = Номенклатура + ", " + СокрЛП(СтрТовары.Номенклатура.БазоваяЕдиницаИзмерения);
			
			Если СтрДлина(ПредставлениеТовара) > 50 Тогда
				ОбластьЦенник.Область("R2C1:R5C3").Шрифт = Новый Шрифт(,7,Истина);
			ИначеЕсли СтрДлина(ПредставлениеТовара) > 40 Тогда
				ОбластьЦенник.Область("R2C1:R5C3").Шрифт = Новый Шрифт(,8,Истина);
			Иначе
				ОбластьЦенник.Область("R2C1:R5C3").Шрифт = Новый Шрифт(,9,Истина);
			КонецЕсли;
			
			СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
			
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			
			Для Ит = 1 По СтрТовары.Количество Цикл 
				Если вСтроке = 5 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
					НаЛисте = НаЛисте+1;
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				Если НаЛисте = 9 Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					НаЛисте = 0;				
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник25х46(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенника25х46");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	НаЛисте =0;
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
		
		Номенклатура = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		//ПредставлениеТовара = Лев(Номенклатура, 50) + ", " + СокрЛП(СтрТовары.Номенклатура.БазоваяЕдиницаИзмерения);
		ПредставлениеТовара = Номенклатура + ", " + СокрЛП(СтрТовары.Номенклатура.БазоваяЕдиницаИзмерения);
		
		Если СтрДлина(ПредставлениеТовара) > 50 Тогда
			ОбластьЦенник.Область("R2C1:R5C3").Шрифт = Новый Шрифт(,8,Истина);
		ИначеЕсли СтрДлина(ПредставлениеТовара) > 40 Тогда
			ОбластьЦенник.Область("R2C1:R5C3").Шрифт = Новый Шрифт(,9,Истина);
		Иначе
			ОбластьЦенник.Область("R2C1:R5C3").Шрифт = Новый Шрифт(,11,Истина);
		КонецЕсли;
		
		//Если СтрДлина(СтрТовары.Цена) > 4 Тогда
		//	ОбластьЦенник.Область("R6C1:R7C3").Шрифт = Новый Шрифт(,22,Истина);
		//Иначе
		//	ОбластьЦенник.Область("R6C1:R7C3").Шрифт = Новый Шрифт(,26,Истина);
		//КонецЕсли;
		
		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			
		Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 4 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
				НаЛисте = НаЛисте+1;
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			Если НаЛисте = 11 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				НаЛисте = 0;				
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник60х38QRБаффет(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенникаБаффет60х38");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	//ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	НаЛисте =0;
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	//Для Каждого СтрТовары Из Объект.Товары Цикл 
	Для Каждого СтрТовары Из тчТовары Цикл 
		Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЦенника = Новый Структура("Артикул");
		ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
		СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
		Цена = Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН=");
		
		Если СтрДлина(Цена)> 6 Тогда
			ОбластьЦенник.Область("R1C6:R5C12").Шрифт = Новый Шрифт(,24,Истина);
		ИначеЕсли СтрДлина(Цена) = 6 Тогда
			ОбластьЦенник.Область("R1C6:R5C12").Шрифт = Новый Шрифт(,28,Истина);
		Иначе
			ОбластьЦенник.Область("R1C6:R5C12").Шрифт = Новый Шрифт(,32,Истина);
		КонецЕсли;
		
		СтруктураЦенника.Вставить("Цена", Цена);
		
		
		ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
		Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.Номенклатура.БазоваяЕдиницаИзмерения);

		Если СтрДлина(ПредставлениеТовара)> 60 Тогда
			ОбластьЦенник.Область("R1C1:R8C5").Шрифт = Новый Шрифт(,10,Истина);
		Иначе
			ОбластьЦенник.Область("R1C1:R8C5").Шрифт = Новый Шрифт(,12,Истина);
		КонецЕсли;

		СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
		
		ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
		
		Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
			СтрокаQR = СокрЛП(СтрТовары.Артикул);
		Иначе
			СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
		КонецЕсли;
				
		СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
		ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
		ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
		
		//ПараметрыШтрихКода = Новый Структура;
		//ПараметрыШтрихКода.Вставить("ШтрихКод", СтрТовары.ШтрихКод);
		//ПараметрыШтрихКода.Вставить("Ширина", 100);     
		//ПараметрыШтрихКода.Вставить("Высота", 50);
		//ПараметрыШтрихКода.Вставить("ТипКода", Истина);
		//ПараметрыШтрихКода.Вставить("ОтображатьТекст", Истина);
		//
		//КартинкаШтрихкода = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихКода);
		//
		//ОбластьЦенник.Рисунки.ШтрихКод.Картинка  =  КартинкаШтрихкода;				

		Для Ит = 1 По СтрТовары.Количество Цикл 
			Если вСтроке = 3 Тогда 
				вСтроке = 0;
			КонецЕсли;
			
			Если вСтроке = 0 Тогда 
				ТабДок.Вывести(ОбластьЦенник);
				НаЛисте = НаЛисте+1;
			Иначе
				ТабДок.Присоединить(ОбластьЦенник);
			КонецЕсли;
			
			Если НаЛисте = 7 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				НаЛисте = 0;
			КонецЕсли;
			
			вСтроке = вСтроке + 1;	
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СформироватьЦенник50х38QR(тчТовары) Экспорт 
	
	КодЯзыка = "uk"; //КодЛокализацииИнформационнойБазы();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
		
	Попытка
		Макет = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПФ_MXL_МакетЦенникаАттика50х38");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Макет.КодЯзыка = КодЯзыка;
	
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьЦенник = Макет.ПолучитьОбласть("Товар|Ценник");
	
	НаЛисте = 0;
	вСтроке = 0;
	Дата = ТекущаяДатаСеанса();
	
	Если ТипЗнч(тчТовары) = Тип("ДанныеФормыКоллекция") Тогда
		тчТоварыСклады = тчТовары.выгрузить(,"Выбран,СкладКомпании");
	Иначе
		тчТоварыСклады = тчТовары.Скопировать(,"Выбран,СкладКомпании");
	КонецЕсли;
	тчТоварыСклады.Свернуть("Выбран,СкладКомпании");
	
	Для Каждого строкаСклад Из тчТоварыСклады Цикл
		Если Не строкаСклад.Выбран Тогда 
			Продолжить;
		КонецЕсли;
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		НаЛисте = 0;
		
		ОбластьСклад.Параметры.Склад="Код:("+строкаСклад.СкладКомпании.Код+")   '"+СокрЛП(строкаСклад.СкладКомпании.Наименование)+"'   маршрут № "+строкаСклад.СкладКомпании.Маршрут;
		ТабДок.Вывести(ОбластьСклад);
		
		НаЛисте = НаЛисте +1;
		вСтроке = 0;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СкладКомпании", строкаСклад.СкладКомпании); 
		ТоварСклада = тчТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для Каждого СтрТовары Из ТоварСклада Цикл 
			Если Не СтрТовары.Выбран ИЛИ СтрТовары.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураЦенника = Новый Структура("Артикул, ШтрихКод");
			ЗаполнитьЗначенияСвойств(СтруктураЦенника, СтрТовары);			
			СтруктураЦенника.Вставить("Дата", Формат(Дата, "ДФ=dd.MM.yy"));
			СтруктураЦенника.Вставить("Цена", Формат(СтрТовары.Цена, "ЧДЦ=2; ЧН="));
			
			ПредставлениеТовара = ?(ЗначениеЗаполнено(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Номенклатура.НаименованиеПолное), СокрЛП(СтрТовары.Наименование2));
			//Если Не СтрТовары.ХарактеристикаНоменклатуры.Пустая() Тогда 
			//	ПредставлениеТовара = ПредставлениеТовара + ", " + СокрЛП(СтрТовары.ХарактеристикаНоменклатуры);
			//КонецЕсли;
			//
			СтруктураЦенника.Вставить("ТоварЕд", ПредставлениеТовара);
			
			ОбластьЦенник.Параметры.Заполнить(СтруктураЦенника);
			
			Если Не ЗначениеЗаполнено(СтрТовары.ШтрихКод) Тогда 
				СтрокаQR = СокрЛП(СтрТовары.Артикул);
			Иначе
				СтрокаQR = СокрЛП(СтрТовары.ШтрихКод);
			КонецЕсли;
			
			СтрокаQR = СтрокаQR + "|" + Формат(СтрТовары.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0");
			
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(СтрокаQR),1,86);
			ОбластьЦенник.Рисунки.QRКод.Картинка  =  Новый Картинка(ДанныеQRКода);				
			
			Для Ит = 1 По СтрТовары.Количество Цикл 
				Если вСтроке = 3 Тогда 
					вСтроке = 0;
				КонецЕсли;
				
				Если вСтроке = 0 Тогда 
					ТабДок.Вывести(ОбластьЦенник);
					НаЛисте = НаЛисте + 1;
				Иначе
					ТабДок.Присоединить(ОбластьЦенник);
				КонецЕсли;
				
				Если НаЛисте = 7 Тогда 
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					НаЛисте = 0;
				КонецЕсли;
				
				вСтроке = вСтроке + 1;	
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
		
	Если ТабДок.ВысотаТаблицы > 0 Тогда 
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
